budget/app/controllers/budget_detail_controller.rb

SELECT * FROM `monthly_budgets` WHERE (`monthly_budgets`.`id` = 1)
UPDATE `monthly_budgets` SET `january` = '400.0', `july` = '900.0', `february` = '300.0', `august` = '1200.0', `march` = '300.0', `september` = '900.0', `april` = '350.0', `october` = '900.0', `may` = '400.0', `november` = '1000.0', `june` = '450.0', `december` = '900.0', `updated_at` = '2011-02-18 20:34:16' WHERE `id` = 564
---
  def update_record
#    jfhajahj
    @budget = MonthlyBudget.find(params[:budget][:id])
#    jksrhkrh
    if @budget.update_attributes(params[:budget])

INSERT INTO `monthly_budgets` (`accounts_id`, `tblAccountID`, `budget_year`, `january`, `february`, `march`, `april`, `may`, `june`, `july`, `august`, `september`, `october`, `november`, `december`, `note`, `created_at`, `updated_at`) VALUES(NULL, 152, '2011', '1880.0', '0.0', '0.0', '0.0', '0.0', '0.0', '0.0', '0.0', '0.0', '0.0', '0.0', '0.0', 'Initial Budgets Entered - 02/18/2011', '2011-02-18 20:28:50', '2011-02-18 20:28:50')
---
  def new
    @budget = MonthlyBudget.new(params[:budget])
#hkshkhjkh
    if @budget.save

SELECT * FROM `monthly_budgets` WHERE (tblAccountID = '143' and budget_year = '2010')
SELECT * FROM `monthly_budgets` WHERE (`monthly_budgets`.`id` = 1)
---
  def get_budget
#    jggkk
    @tblAccountID = params[:tblAccountID]
    @year = params[:year]
    next_year = (@year.to_i + 1).to_s
    @prior_year = (@year.to_i - 1).to_s

    prior_period = PeriodDate.get_period(@prior_year)
    start_period = PeriodDate.get_period(@year)
    end_period = PeriodDate.get_period(next_year)

#   need the GL code fromthe index
    glcode = Account.find(@tblAccountID)
    @glcode = glcode.AccountNumber

    # Only deals with BUD1 values
    @approved_budget = BudgetTransaction.sum('Amount', :conditions =>
                                      ["GLAccount = ? AND tblPeriodDateID >= ?
                                        AND tblPeriodDateID < ? AND
                                        tblBudgetLevelID = 1",
                                        @glcode, start_period, end_period])

    budgets = MonthlyBudget.all(:conditions => ["tblAccountID = ? and budget_year = ?",
                                          @tblAccountID, @year] )
    #got to be a better way of doing the next few rows to get prior_budget
    prior_budgets = MonthlyBudget.all(:conditions => ["tblAccountID = ? and budget_year = ?",
                                          @tblAccountID, @prior_year] )
    prior_budgets.each do |x|
      @prior_budget = MonthlyBudget.find(x.id)